// Мінімум

// 1. Запитай у користувача його вік і визначи, ким він є: дитиною (0-11), підлітком (12-17), дорослим (18_59) або пенсіонером (60 ...), передбач можливість введення невірних даних.

// let age = +prompt("Скільки тобі років?");

// if (age <= 11 && age > 0) {
//   alert("Дитина");
// } else if (age > 11 && age < 18) {
//   alert("Підліток");
// } else if (age > 17 && age < 60) {
//   alert("Дорослий");
// } else if (age > 60 && age < 130) {
//   alert("Пенсіонер");
// } else {
//   alert("Перевірте правильність введення числа");
// }

// 2. Запитай у користувача число від 0 до 9 і виведи йому спецсимвол, який розташований на цій клавіші (1 !, 2 @, 3 # і т. д).

// let num = prompt("Вкажи число від 0 до 9");

// let newNum = (num == '0') ? alert(')') :
//   (num == '1') ? alert('!') :
//   (num == '2') ? alert('@') :
//   (num == '3') ? alert('#') :
//   (num == '4') ? alert('$') :
//   (num == '5') ? alert('%') :
//   (num == '6') ? alert('^') :
//   (num == '7') ? alert('&') :
//   (num == '8') ? alert('*') :
//   (num == '9') ? alert('(') :
//   alert('Це не число від 0 до 9');

// 3. Підрахуй суму всіх чисел в заданому користувачем діапазоні.

// let num = Number();

// while (true) {

//   let value = +prompt("Введіть число");

//   if (!value) break;

//   num += value;
// }

// alert(`Сумма твоїх чисел: ${num}`)

// 4. Запитай у користувача 2 числа і знайди найбільший спільний дільник.

// 5. Запитай у користувача число і виведи всі дільники цього числа.

// let num = +prompt("Введіть число","");

// for (let i = 1; i <= num; i++) {
//   if (num%i==0) {
//     console.log(i);
//   }
// }

// Норма

// 1. Запитай у користувача п’ятирозрядне число і визначи, чи є воно паліндромом.

// let num = +prompt("Введіть п’ятирозрядне число");

// let num1 = num % 10;

// let num2 = Math.floor(num / 10) % 10;

// let num3 = Math.floor(Math.floor(num / 10) / 10) % 10;

// let num4 = Math.floor(Math.floor(Math.floor(num / 10) / 10) / 10) % 10;

// let num5 = Math.floor(num / 10000);

// let oldNum = (`${num5}${num4}${num3}${num2}${num1}`);

// let newNum = ('' + num1 + num2 + num3 + num4 + num5);

// if(num5 === num1 && num4 === num2){
//   alert(`Число ${oldNum} є паліндромом ${newNum}`)
// }else {
//   alert(`Число ${oldNum} не є паліндромом`)
// }

// 2. Запитай у користувача суму покупки і виведи суму до оплати зі знижкою:
// від 200 до 300 - знижка буде 3%;
// від 300 до 500 - 5%;
// від 500 і вище - 7%.

// const uah = " грн.";
// let sum = +prompt(`Яка сума твоєї покупки? в${uah}`)

// const sale3 = sum / 100 * 3;
// const sale5 = sum / 100 * 5;
// const sale7 = sum / 100 * 7;

// if (sum < 1) {
//   alert(`А міг щось купити..`);
// } else if (sum >= 200 && sum < 300){
//   alert(`Загальна сума ${sum + uah} Вітаю! Ти маєш знижку 3% до оплати ${sum - sale3 + uah}`);
// } else if (sum >= 300 && sum < 500) {
//   alert(`Загальна сума ${sum + uah} Вітаю! Ти маєш знижку 5% до оплати ${sum - sale5 + uah}`);
// } else if (sum >= 500) {
//   alert(`Загальна сума ${sum + uah} Вітаю! Ти маєш знижку 7% до оплати ${sum - sale7 + uah}`);
// } else {
//   alert(`Загальна сума ${sum + uah} Вітаю! Оплати ${sum + uah}`);
// }

// 3. Запитай у користувача 10 чисел і порахуй, скільки він ввів додатніх, від’ємних і нулів. При цьому також порахуй, скільки з них парних і непарних. Виведи статистику на екран. Враховуй, що достатньо однієї змінної (не 10) для введення чисел користувачем.

// // Додатніх
// let numPlus = 0;
// // Відємних
// let numMinus = 0;
// // Нулів
// let num0 = 0;
// // Парних
// let numEven = 0;
// // Не парних
// let numNotEven = 0;

// // Десять запитів
// for (let ten = 0; ten < 10; ten++) {
//   let num = prompt("Введіть числа, які хочете перевірити");
//   // Перевірка на відміну
//   if (num == null) break;
//   // Перевірка на ОК без значення
//   if (num == "") {
//     alert("Не ввели число");
//     num0--;
//     ten--;
//   }
//   // Перевірка на літери
//   num = Number(num);
//   if (isNaN(num)) {
//     alert("Це не число");
//     ten--;
//   }
//   // Додатніх
//   if (num > 0) {
//     numPlus++;
//   }
//   // Відємних
//   if (num < 0) {
//     numMinus++;
//   }
//   // Нулів
//   if (num == 0) {
//     num0++;
//   }
//   // Парних
//   if (num % 2 == 0 && num != 0) {
//     numEven++;
//   }
//   // Не парних
//   if (num % 2 != 0) {
//     numNotEven++;
//   }
// }
// alert(
//   `Додатніх: ${numPlus};\nВідємних: ${numMinus};\nНулів: ${num0};\nПарних: ${numEven};\nНе парних: ${numNotEven};`
// );


// 4. Зацикли відображення днів тижня таким чином: «День тижня. Хочеш побачити наступний день? » і так до тих пір, поки користувач натискає OK.

// const text = "Хочеш побачити наступний день?";

// while (true) {
//   monday = confirm(`Понеділок. ${text}`);
//   if (!monday) break;
//   tuesday = confirm(`Вівторок. ${text}`);
//   if (!tuesday) break;
//   wednesday = confirm(`Середа. ${text}`);
//   if (!wednesday) break;
//   thursday = confirm(`Четвер. ${text}`);
//   if (!thursday) break;
//   friday = confirm(`П'ятниця. ${text}`);
//   if (!friday) break;
//   saturday = confirm(`Субота. ${text}`);
//   if (!saturday) break;
//   sunday = confirm(`Неділя. ${text}`);
//   if (!sunday) break;
// }

