// Мінімум

// 1. Напиши всі можливі варіанти створення функцій.

// function showMessage(text='Пусто'){
//   alert(text)
// }
// showMessage('Привіт');

// let showMessage = function() {
//   alert( "Привіт" );
// };
// showMessage();

// 2. Створи функцію, яка буде виводити кількість переданих їй аргументів.

// let howMachArg = function(){
//   alert(arguments.length);
// }
// howMachArg('arg1', 'arg2', 'arg3' , '...');

// 3. Напиши функцію, яка приймає 2 числа і повертає :
// -1, якщо перше число менше, ніж друге;
// 1 - якщо перше число більше, ніж друге;
// 0 - якщо числа рівні.

// function checkNumber(){
//   let num1 = +prompt('Перше число?');
//   let num2 = +prompt('Друге число?');
//   if (num1 < num2){
//     return alert(-1);
//   } else if (num1 > num2){
//     return alert(1);
//   } else {
//     return alert(0);
//   }
// }
// checkNumber();

// 4. Напиши функцію, яка обчислює факторіал переданого їй числа.

// ---

// 5.Напиши функцію, яка приймає три окремі цифри і перетворює їх в одне число. Наприклад: цифри 1, 4, 9 перетворяться в число 149.

// function oneNum(){
//   let num1 = +prompt('Перше число?');
//   let num2 = +prompt('Друге число?');
//   let num3 = +prompt('Третє число?');
//   return alert(String(num1) + (num2) + (num3));
// }
// oneNum();

// 6. Напиши функцію, яка приймає довжину і ширину прямокутника і обчислює його площу. Якщо в функцію передали 1 параметр, то вона обчислює площу квадрата.

// function parametr() {
//   let height = +prompt("довжина в см?");
//   let width = +prompt("ширина в см?");
//   if (height == 0) {
//     alert(width * width);
//   } else if (width == 0) {
//     alert(height * height);
//   } else alert(width * height);
// }
// parametr();

// Норма

// 1. Напиши функцію, яка перевіряє, чи є передане їй число “досконалим числом”. Досконале число - це число, яке дорівнює сумі всіх своїх дільників.

// ---

// 2. Напиши функцію, яка приймає мінімальне і максимальне значення для діапазону, і виводить тільки ті числа з діапазону, які є досконалими. Використовуй написану раніше функцію, щоб дізнатися, чи є це число досконалим.

// ---