// Мінімум
// 1. Створи об'єкт, що описує автомобіль (виробник, модель, рік випуску, середня швидкість, обсяг паливного баку, середня витрата палива на 100 км., водії), і наступні методи для роботи з цим об'єктом:
// let car = {
//   manufacturer: "Корея",
//   model: "KIA RIO",
//   year: "2003р",
//   speed: "70 км/год",
//   cistern: "40 л",
//   costs: "7л",
// };

// // 1.Метод, який виводить на екран інформацію про автомобіль.
// function carInfo() {
//   // for (let key in car) {
//     // alert(`${key}: ${car[key]}`);
//     alert(`${car[1]}`)
//   // }
// }

// carInfo();

// 2. Додавання ім’я водія у список
// car["name"] = prompt("Вкажіть ім’я водія");

// 3. Перевірка водія на наявність його ім’я у списку
// let isName = prompt(`Яке ім’я водія перевірити в списках?`,`${car["name"]}`);

// if (car.name === isName){
//   alert('Водій з таким ім’ям в списку')
// } else {
//   alert('В списках немає')
// }


// 4. Підрахунок необхідного часу та кількості палива для подолання переданої відстані з середньою швидкістю. Враховуй, що через кожні 4 години дороги водієві необхідно робити перерву на 1 годину. 
// carInfo();

// let length = prompt("Введіть відстань");

// палива для подолання переданої відстані
// let y = ((car.costs.replace(/[^0-9]/g, "") / 100).toFixed(2) * length).toFixed(1);

// console.log(x);


// // Норма

// // 1. Створити об'єкт, що описує час (години, хвилини, секунди), і такі функції для роботи з цим об'єктом:

// let time = { 
//   hours: '12',
//   min: '25',
//   sek: '05',
//   // // 1.1 Для виведення часу на екран.
//   showTime: function(){
//     alert(`${time.hours}:${time.min}:${time.sek}`);
//   },
// }


// time.showTime();


// // // 1.2 Зміни часу на передану кількість секунд.

// function reSek(){
//   do {
//     time.sek = +prompt("Введіть секунди");
//     if (time.sek >= 60){
//       alert('Секунд не може бути більше 60');
//     }
//   } while (time.sek >= 60);  
// }
// reSek();


// // 1.3 Зміни часу на передану кількість хвилин.
// function reMin(){
//   do {
//     time.min = +prompt("Введіть хвилини");
//     if (time.min >= 60){
//       alert('Хвилин не може бути більше 60');
//     }
//   } while (time.min >= 60);  
// }
// reMin();


// // 1.4 Зміни часу на передану кількість годин.
// function reHours(){
//   do {
//     time.hours = +prompt("Введіть години");
//     if (time.hours > 24){
//       alert('Годин не може бути більше 24');
//     } else if (time.hours == 24){
//       time.hours = '00';
//     }
//   } while (time.hours > 24);  
// }
// reHours();

// // 1.5 Враховуйте, що в останніх 3-х функціях, при зміні однієї частини часу, може змінитися і інша. Наприклад: якщо до часу «20:59:45» додати 30 секунд, то повинно вийти «21:00:15», а не «20:59:75». Також потрібно передбачити можливість того що користувач може передати 150 секунд, або 75 хвилин.

// //---

// showTime();